turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2C.atdf
      <value-group caption="" name="SUPC_MR__ONREG">
        <value caption="Voltage Regulator is not used" name="ONREG_UNUSED" value="0"/>
        <value caption="Voltage Regulator is used" name="ONREG_USED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="no effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="the 32-KHz XTAL oscillator is selected and is put in bypass mode." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="the supply monitor detection has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the supply monitor detection forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="the RTT alarm signal has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTT alarm signal forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="the RTC alarm signal has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the RTC alarm signal forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN0">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN1">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN2">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN3">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN4">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN5">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN6">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN7">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN8">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN9">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN10">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN11">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN12">
        <value caption="the corresponding wake-up input has no wake up effect." name="DISABLE" value="0"/>
        <value caption="the corresponding wake-up input forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
