turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2C.atdf
        <register caption="Counter Value (channel = 0)" name="TC_CV0" offset="0x10" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 0)" name="TC_RA0" offset="0x14" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 0)" name="TC_RB0" offset="0x18" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 0)" name="TC_RC0" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 0)" name="TC_SR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 0)" name="TC_IER0" offset="0x24" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Disable Register (channel = 0)" name="TC_IDR0" offset="0x28" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Interrupt Mask Register (channel = 0)" name="TC_IMR0" offset="0x2C" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
        </register>
        <register caption="Channel Control Register (channel = 1)" name="TC_CCR1" offset="0x40" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 1)" name="TC_CMR1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR1__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR1__BURST"/>
          <bitfield caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR1__ETRGEDG"/>
          <bitfield caption="TIOA or TIOB External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR1__LDRA"/>
          <bitfield caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR1__LDRB"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 1)" name="TC_SMMR1" offset="0x48" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Counter Value (channel = 1)" name="TC_CV1" offset="0x50" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 1)" name="TC_RA1" offset="0x54" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 1)" name="TC_RB1" offset="0x58" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 1)" name="TC_RC1" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 1)" name="TC_SR1" offset="0x60" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
