turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2C.atdf
    <module name="LOCKBIT" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits" name="LOCKBIT" offset="0x0" rw="RW" size="1">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
        </register>
      </register-group>
    </module>
  <module name="SystemControl" caption="System Control Registers">
            <register-group name="SystemControl" caption="System Control Registers">
                <register offset="0x00000008" size="4" name="ACTLR" initval="0" caption="Auxiliary Control Register,">
                    <bitfield mask="0x00000001" name="DISMCYCINT" caption="Disables interruption of multi-cycle instructions."/>
                    <bitfield mask="0x00000002" name="DISDEFWBUF" caption="Disables write buffer use during default memory map accesses."/>
                    <bitfield mask="0x00000004" name="DISFOLD" caption="Disables folding of IT instructions."/>
                </register>
                <register offset="0x00000d00" size="4" name="CPUID" initval="0x410FC240" caption="CPUID Base Register">
                    <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
                    <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
                    <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
                    <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
                </register>
                <register offset="0x00000d04" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
                    <bitfield mask="0x000001ff" name="VECTACTIVE" caption="Active exception number"/>
                    <bitfield mask="0x00000800" name="RETTOBASE" values="RETTOBASE" caption="no description available"/>
                    <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
                    <bitfield mask="0x00400000" name="ISRPENDING" caption="no description available"/>
                    <bitfield mask="0x00800000" name="ISRPREEMPT" values="ISRPREEMPT" caption="no description available"/>
                    <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="no description available"/>
                    <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="no description available"/>
                    <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="no description available"/>
                    <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="no description available"/>
                    <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="no description available"/>
                </register>
                <register offset="0x00000d08" size="4" name="VTOR" initval="0" caption="Vector Table Offset Register">
                    <bitfield mask="0xffffff80" name="TBLOFF" caption="Vector table base offset"/>
                </register>
                <register offset="0x00000d0c" size="4" name="AIRCR" initval="0" caption="Application Interrupt and Reset Control Register">
                    <bitfield mask="0x00000001" name="VECTRESET" caption="no description available"/>
                    <bitfield mask="0x00000002" name="VECTCLRACTIVE" caption="no description available"/>
                    <bitfield mask="0x00000004" name="SYSRESETREQ" values="SYSRESETREQ" caption="no description available"/>
                    <bitfield mask="0x00000700" name="PRIGROUP" caption="Interrupt priority grouping field. This field determines the split of group priority from subpriority."/>
                    <bitfield mask="0x00008000" name="ENDIANNESS" values="ENDIANNESS" caption="no description available"/>
                    <bitfield mask="0xffff0000" name="VECTKEY" caption="Register key"/>
                </register>
                <register offset="0x00000d10" size="4" name="SCR" initval="0" caption="System Control Register">
                    <bitfield mask="0x00000002" name="SLEEPONEXIT" values="SLEEPONEXIT" caption="no description available"/>
                    <bitfield mask="0x00000004" name="SLEEPDEEP" values="SLEEPDEEP" caption="no description available"/>
                    <bitfield mask="0x00000010" name="SEVONPEND" values="SEVONPEND" caption="no description available"/>
                </register>
                <register offset="0x00000d14" size="4" name="CCR" initval="0" caption="Configuration and Control Register">
                    <bitfield mask="0x00000001" name="NONBASETHRDENA" values="NONBASETHRDENA" caption="no description available"/>
                    <bitfield mask="0x00000002" name="USERSETMPEND" values="USERSETMPEND" caption="Enables unprivileged software access to the STIR"/>
                    <bitfield mask="0x00000008" name="UNALIGN_TRP" values="UNALIGN_TRP" caption="Enables unaligned access traps"/>
                    <bitfield mask="0x00000010" name="DIV_0_TRP" values="DIV_0_TRP" caption="Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0"/>
                    <bitfield mask="0x00000100" name="BFHFNMIGN" values="BFHFNMIGN" caption="Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions."/>
                    <bitfield mask="0x00000200" name="STKALIGN" values="STKALIGN" caption="Indicates stack alignment on exception entry"/>
                </register>
                <register offset="0x00000d18" size="4" name="SHPR1" initval="0" caption="System Handler Priority Register 1">
                    <bitfield mask="0x000000ff" name="PRI_4" caption="Priority of system handler 4, MemManage"/>
                    <bitfield mask="0x0000ff00" name="PRI_5" caption="Priority of system handler 5, BusFault"/>
                    <bitfield mask="0x00ff0000" name="PRI_6" caption="Priority of system handler 6, UsageFault"/>
                </register>
                <register offset="0x00000d1c" size="4" name="SHPR2" initval="0" caption="System Handler Priority Register 2">
                    <bitfield mask="0xff000000" name="PRI_11" caption="Priority of system handler 11, SVCall"/>
                </register>
                <register offset="0x00000d20" size="4" name="SHPR3" initval="0" caption="System Handler Priority Register 3">
                    <bitfield mask="0x00ff0000" name="PRI_14" caption="Priority of system handler 14, PendSV"/>
                    <bitfield mask="0xff000000" name="PRI_15" caption="Priority of system handler 15, SysTick exception"/>
                </register>
                <register offset="0x00000d24" size="4" name="SHCSR" initval="0" caption="System Handler Control and State Register">
                    <bitfield mask="0x00000001" name="MEMFAULTACT" values="MEMFAULTACT" caption="no description available"/>
                    <bitfield mask="0x00000002" name="BUSFAULTACT" values="BUSFAULTACT" caption="no description available"/>
                    <bitfield mask="0x00000008" name="USGFAULTACT" values="USGFAULTACT" caption="no description available"/>
                    <bitfield mask="0x00000080" name="SVCALLACT" values="SVCALLACT" caption="no description available"/>
                    <bitfield mask="0x00000100" name="MONITORACT" values="MONITORACT" caption="no description available"/>
                    <bitfield mask="0x00000400" name="PENDSVACT" values="PENDSVACT" caption="no description available"/>
                    <bitfield mask="0x00000800" name="SYSTICKACT" values="SYSTICKACT" caption="no description available"/>
                    <bitfield mask="0x00001000" name="USGFAULTPENDED" values="USGFAULTPENDED" caption="no description available"/>
                    <bitfield mask="0x00002000" name="MEMFAULTPENDED" values="MEMFAULTPENDED" caption="no description available"/>
                    <bitfield mask="0x00004000" name="BUSFAULTPENDED" values="BUSFAULTPENDED" caption="no description available"/>
                    <bitfield mask="0x00008000" name="SVCALLPENDED" values="SVCALLPENDED" caption="no description available"/>
                    <bitfield mask="0x00010000" name="MEMFAULTENA" values="MEMFAULTENA" caption="no description available"/>
                    <bitfield mask="0x00020000" name="BUSFAULTENA" values="BUSFAULTENA" caption="no description available"/>
                    <bitfield mask="0x00040000" name="USGFAULTENA" values="USGFAULTENA" caption="no description available"/>
                </register>
