turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2C.atdf
                <register offset="0x00000348" size="1" name="NVICIP72" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI72" caption="Priority of interrupt 72"/>
                </register>
                <register offset="0x00000349" size="1" name="NVICIP73" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI73" caption="Priority of interrupt 73"/>
                </register>
                <register offset="0x0000034a" size="1" name="NVICIP74" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI74" caption="Priority of interrupt 74"/>
                </register>
                <register offset="0x0000034b" size="1" name="NVICIP75" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI75" caption="Priority of interrupt 75"/>
                </register>
                <register offset="0x0000034c" size="1" name="NVICIP76" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI76" caption="Priority of interrupt 76"/>
                </register>
                <register offset="0x0000034d" size="1" name="NVICIP77" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI77" caption="Priority of interrupt 77"/>
                </register>
                <register offset="0x0000034e" size="1" name="NVICIP78" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI78" caption="Priority of interrupt 78"/>
                </register>
                <register offset="0x0000034f" size="1" name="NVICIP79" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI79" caption="Priority of interrupt 79"/>
                </register>
                <register offset="0x00000350" size="1" name="NVICIP80" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI80" caption="Priority of interrupt 80"/>
                </register>
                <register offset="0x00000351" size="1" name="NVICIP81" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI81" caption="Priority of interrupt 81"/>
                </register>
                <register offset="0x00000352" size="1" name="NVICIP82" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI82" caption="Priority of interrupt 82"/>
                </register>
                <register offset="0x00000353" size="1" name="NVICIP83" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI83" caption="Priority of interrupt 83"/>
                </register>
                <register offset="0x00000354" size="1" name="NVICIP84" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI84" caption="Priority of interrupt 84"/>
                </register>
                <register offset="0x00000355" size="1" name="NVICIP85" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI85" caption="Priority of interrupt 85"/>
                </register>
                <register offset="0x00000356" size="1" name="NVICIP86" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI86" caption="Priority of interrupt 86"/>
                </register>
                <register offset="0x00000357" size="1" name="NVICIP87" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI87" caption="Priority of interrupt 87"/>
                </register>
                <register offset="0x00000358" size="1" name="NVICIP88" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI88" caption="Priority of interrupt 88"/>
                </register>
                <register offset="0x00000359" size="1" name="NVICIP89" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI89" caption="Priority of interrupt 89"/>
                </register>
                <register offset="0x0000035a" size="1" name="NVICIP90" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI90" caption="Priority of interrupt 90"/>
                </register>
                <register offset="0x0000035b" size="1" name="NVICIP91" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI91" caption="Priority of interrupt 91"/>
                </register>
                <register offset="0x0000035c" size="1" name="NVICIP92" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI92" caption="Priority of interrupt 92"/>
                </register>
                <register offset="0x0000035d" size="1" name="NVICIP93" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI93" caption="Priority of interrupt 93"/>
                </register>
                <register offset="0x0000035e" size="1" name="NVICIP94" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI94" caption="Priority of interrupt 94"/>
                </register>
                <register offset="0x0000035f" size="1" name="NVICIP95" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI95" caption="Priority of interrupt 95"/>
                </register>
